Repository: paeterna/StartAD_AGF_SelfDiscovory
Catalog: assets/i18n/app_*.arb
Languages: ar

# appName
source: SelfMap
ar: خريطة الذات

# welcomeMessage
source: Welcome to SelfMap
ar: مرحباً بك في خريطة الذات

# tagline
source: Discover Your Future
ar: اكتشف مستقبلك

# authLoginTitle
source: Sign In
ar: تسجيل الدخول

# authSignupTitle
source: Create Account
ar: إنشاء حساب

# authEmailLabel
source: Email Address
ar: البريد الإلكتروني

# authPasswordLabel
source: Password
ar: كلمة المرور

# authConfirmPasswordLabel
source: Confirm Password
ar: تأكيد كلمة المرور

# authDisplayNameLabel
source: Display Name
ar: الاسم

# authLoginButton
source: Sign In
ar: تسجيل الدخول

# authSignupButton
source: Sign Up
ar: إنشاء حساب

# authForgotPassword
source: Forgot Password?
ar: نسيت كلمة المرور؟

# authResetPassword
source: Reset Password
ar: إعادة تعيين كلمة المرور

# authResetPasswordMessage
source: Enter your email address and we'll send you a link to reset your password.
ar: أدخل عنوان بريدك الإلكتروني وسنرسل لك رابط إعادة تعيين كلمة المرور.

# authResetPasswordSuccess
source: Password reset link sent! Check your email.
ar: تم إرسال رابط إعادة تعيين كلمة المرور! تحقق من بريدك الإلكتروني.

# authSendResetLink
source: Send Reset Link
ar: إرسال رابط الإعادة

# authSwitchToSignup
source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجل الآن

# authSwitchToLogin
source: Already have an account? Sign in
ar: لديك حساب؟ سجل الدخول

# authLogoutButton
source: Log Out
ar: تسجيل الخروج

# authLoggingIn
source: Signing in...
ar: جارٍ تسجيل الدخول...

# authSigningUp
source: Creating account...
ar: جارٍ إنشاء الحساب...

# authGoogleSignIn
source: Continue with Google
ar: متابعة مع Google

# authDividerOr
source: OR
ar: أو

# authPrivacyLink
source: Privacy
ar: الخصوصية

# authTermsLink
source: Terms
ar: الشروط

# onboardingTitle
source: Let's Get Started!
ar: لنبدأ!

# onboardingSubtitle
source: Answer a few questions to personalize your journey
ar: أجب عن بعض الأسئلة لتخصيص رحلتك

# onboardingQuestionPrefix
source: Question {current} of {total}
ar: السؤال {current} من {total}

# onboardingNextButton
source: Next
ar: التالي

# onboardingBackButton
source: Back
ar: السابق

# onboardingFinishButton
source: Finish
ar: إنهاء

# onboardingSkipButton
source: Skip
ar: تخطي

# welcomeTitle
source: Welcome to SelfMap! 🚀
ar: مرحباً بك في خريطة الذات! 🚀

# welcomeSubtitle
source: Discover who you are and where you're going
ar: اكتشف من أنت وإلى أين تتجه

# welcomeGetStartedButton
source: Let's Get Started! ✨
ar: لنبدأ! ✨

# welcomeQuickTitle
source: Quick & Fun
ar: سريع وممتع

# welcomeQuickDescription
source: Takes just 2 minutes!
ar: يستغرق دقيقتين فقط!

# welcomeDiscoverTitle
source: Discover Yourself
ar: اكتشف نفسك

# welcomeDiscoverDescription
source: Find your unique strengths
ar: اعثر على نقاط قوتك الفريدة

# welcomePlanTitle
source: Plan Your Future
ar: خطط لمستقبلك

# welcomePlanDescription
source: Get personalized career paths
ar: احصل على مسارات مهنية مخصصة

# onboardingQuestion1
source: When faced with a problem, I prefer to:
ar: عندما أواجه مشكلة، أفضل أن:

# onboardingQ1Option1
source: Analyze it logically
ar: أحللها منطقياً

# onboardingQ1Option2
source: Think creatively
ar: أفكر بطريقة إبداعية

# onboardingQ1Option3
source: Discuss with others
ar: أناقشها مع الآخرين

# onboardingQuestion2
source: I feel most energized when:
ar: أشعر بأكبر قدر من الطاقة عندما:

# onboardingQ2Option1
source: Working independently
ar: أعمل بشكل مستقل

# onboardingQ2Option2
source: Collaborating with a team
ar: أتعاون مع فريق

# onboardingQ2Option3
source: Leading group activities
ar: أقود الأنشطة الجماعية

# onboardingQuestion3
source: When starting a new project, I:
ar: عند بدء مشروع جديد، أنا:

# onboardingQ3Option1
source: Follow established methods
ar: أتبع الطرق المجربة

# onboardingQ3Option2
source: Experiment with new approaches
ar: أجرب مناهج جديدة

# onboardingQ3Option3
source: Combine proven and new ideas
ar: أدمج الأفكار المجربة والجديدة

# onboardingQuestion4
source: I am most interested in:
ar: أنا مهتم أكثر بـ:

# onboardingQ4Option1
source: Learning new skills
ar: تعلم مهارات جديدة

# onboardingQ4Option2
source: Mastering what I know
ar: إتقان ما أعرفه

# onboardingQ4Option3
source: Applying knowledge practically
ar: تطبيق المعرفة عملياً

# onboardingQuestion5
source: When working on tasks, I:
ar: عند العمل على المهام، أنا:

# onboardingQ5Option1
source: Focus on the big picture
ar: أركز على الصورة الكبيرة

# onboardingQ5Option2
source: Pay attention to details
ar: أنتبه للتفاصيل

# onboardingQ5Option3
source: Balance both approaches
ar: أوازن بين الطريقتين

# dashboardTitle
source: Dashboard
ar: لوحة المعلومات

# dashboardWelcome
source: Welcome back, {name}!
ar: مرحباً بعودتك، {name}!

# dashboardProgressLabel
source: Discovery Progress
ar: تقدم الاكتشاف

# dashboardStreakLabel
source: Day Streak
ar: سلسلة الأيام

# dashboardStreakDays
source: {days} days
ar: {days} أيام

# dashboardContinueDiscovery
source: Continue Discovery
ar: متابعة الاكتشاف

# dashboardViewCareers
source: Explore Careers
ar: استكشاف المهن

# dashboardStartRoadmap
source: View Roadmap
ar: عرض خارطة الطريق

# dashboardWhatsNext
source: What's Next?
ar: ما التالي؟

# dashboardContinueDiscoverySubtitle
source: Take quizzes and games
ar: خذ الاختبارات والعب الألعاب

# dashboardViewCareersSubtitle
source: Find careers that match you
ar: ابحث عن المهن التي تناسبك

# dashboardStartRoadmapSubtitle
source: Plan your path to success
ar: خطط طريقك نحو النجاح

# dashboardProfileProgress
source: Profile Progress
ar: تقدم الملف الشخصي

# dashboardProgressJustStarted
source: Just Getting Started
ar: بداية الرحلة

# dashboardProgressGettingThere
source: Getting There
ar: في الطريق

# dashboardProgressAlmostDone
source: Almost Done
ar: على وشك الانتهاء

# dashboardProgressComplete
source: Profile Complete!
ar: الملف مكتمل!

# dashboardProgressHint
source: Complete more quizzes and games to improve your matches
ar: أكمل المزيد من الاختبارات والألعاب لتحسين التطابقات

# dashboardProgressCompleteHint
source: Great job! Your profile is complete and matches are optimized
ar: عمل رائع! ملفك الشخصي مكتمل والتطابقات محسّنة

# discoverTitle
source: Discover
ar: اكتشف

# discoverSubtitle
source: Take quizzes and play games to learn more about yourself
ar: خذ الاختبارات والعب الألعاب لتتعرف على نفسك أكثر

# discoverQuizzesTab
source: Quizzes
ar: الاختبارات

# discoverGamesTab
source: Games
ar: الألعاب

# discoverStartButton
source: Start
ar: ابدأ

# discoverResumeButton
source: Resume
ar: استئناف

# discoverCompletedBadge
source: Completed
ar: مكتمل

# discoverLockedBadge
source: Locked
ar: مقفل

# discoverProgressLabel
source: {completed} of {total} completed
ar: {completed} من {total} مكتمل

# discoverDurationMinutes
source: {minutes} min
ar: {minutes} دقيقة

# quizPersonalityTitle
source: Personality Discovery
ar: اكتشاف الشخصية

# quizPersonalityDescription
source: Discover your core personality traits
ar: اكتشف سمات شخصيتك الأساسية

# quizInterestTitle
source: Interest Explorer
ar: مستكشف الاهتمامات

# quizInterestDescription
source: Identify your key interests
ar: حدد اهتماماتك الرئيسية

# quizSkillsTitle
source: Skills Assessment
ar: تقييم المهارات

# quizSkillsDescription
source: Evaluate your current skills
ar: قيم مهاراتك الحالية

# gamePatternTitle
source: Pattern Recognition
ar: التعرف على الأنماط

# gamePatternDescription
source: Test your analytical skills
ar: اختبر مهاراتك التحليلية

# gameCreativeTitle
source: Creative Challenge
ar: التحدي الإبداعي

# gameCreativeDescription
source: Explore your creativity
ar: استكشف إبداعك

# careersTitle
source: Careers
ar: المهن

# careersSubtitle
source: Explore careers that match your interests
ar: استكشف المهن التي تناسب اهتماماتك

# careersFilterLabel
source: Filter by
ar: تصفية حسب

# careersFilterAll
source: All
ar: الكل

# careersSearchHint
source: Search careers...
ar: ابحث عن المهن...

# careersMatchScoreLabel
source: Match Score
ar: درجة التطابق

# careersHighMatch
source: High Match
ar: تطابق عالٍ

# careersMediumMatch
source: Medium Match
ar: تطابق متوسط

# careersLowMatch
source: Explore More
ar: استكشف المزيد

# careersAddToRoadmapButton
source: Add to Roadmap
ar: إضافة إلى خارطة الطريق

# careersViewDetailsButton
source: View Details
ar: عرض التفاصيل

# careersEmptyState
source: No careers found. Try adjusting your filters.
ar: لم يتم العثور على مهن. جرب تعديل الفلاتر.

# careerSoftwareEngineerTitle
source: Software Engineer
ar: مهندس برمجيات

# careerSoftwareEngineerDescription
source: Design, develop, and maintain software applications
ar: تصميم وتطوير وصيانة تطبيقات البرمجيات

# careerDataScientistTitle
source: Data Scientist
ar: عالم بيانات

# careerDataScientistDescription
source: Analyze complex data to help organizations make decisions
ar: تحليل البيانات المعقدة لمساعدة المؤسسات على اتخاذ القرارات

# careerGraphicDesignerTitle
source: Graphic Designer
ar: مصمم جرافيك

# careerGraphicDesignerDescription
source: Create visual concepts to communicate ideas
ar: إنشاء مفاهيم بصرية لتوصيل الأفكار

# careerMarketingManagerTitle
source: Marketing Manager
ar: مدير التسويق

# careerMarketingManagerDescription
source: Plan and execute marketing strategies
ar: تخطيط وتنفيذ استراتيجيات التسويق

# clusterTechnology
source: Technology
ar: التكنولوجيا

# clusterSTEM
source: STEM
ar: العلوم والتكنولوجيا

# clusterArtsHumanities
source: Arts & Humanities
ar: الفنون والعلوم الإنسانية

# clusterBusinessFinance
source: Business & Finance
ar: الأعمال والمالية

# roadmapTitle
source: Roadmap
ar: خارطة الطريق

# roadmapSubtitle
source: Your personalized path to success
ar: مسارك الشخصي نحو النجاح

# roadmapSelectCareer
source: Select a career to see your roadmap
ar: اختر مهنة لرؤية خارطة الطريق

# roadmapProgressLabel
source: Progress
ar: التقدم

# roadmapProgressValue
source: {completed} of {total} steps
ar: {completed} من {total} خطوات

# roadmapMarkCompleteButton
source: Mark Complete
ar: وضع علامة مكتمل

# roadmapMarkIncompleteButton
source: Mark Incomplete
ar: وضع علامة غير مكتمل

# roadmapEmptyState
source: Add careers to your roadmap to get started
ar: أضف مهناً إلى خارطة الطريق للبدء

# roadmapSoftwareEngineerTitle
source: Software Engineer Roadmap
ar: خارطة طريق مهندس البرمجيات

# roadmapStepProgrammingTitle
source: Master Programming Fundamentals
ar: إتقان أساسيات البرمجة

# roadmapStepProgrammingDescription
source: Learn programming basics with Python or JavaScript
ar: تعلم أساسيات البرمجة باستخدام Python أو JavaScript

# roadmapStepProjectsTitle
source: Build Personal Projects
ar: بناء مشاريع شخصية

# roadmapStepProjectsDescription
source: Create 3-5 projects showcasing different skills
ar: إنشاء 3-5 مشاريع تعرض مهارات مختلفة

# roadmapStepAlgorithmsTitle
source: Learn Data Structures & Algorithms
ar: تعلم هياكل البيانات والخوارزميات

# roadmapStepAlgorithmsDescription
source: Study common data structures and algorithms
ar: دراسة هياكل البيانات والخوارزميات الشائعة

# roadmapStepOpenSourceTitle
source: Contribute to Open Source
ar: المساهمة في المصادر المفتوحة

# roadmapStepOpenSourceDescription
source: Find open source projects and make contributions
ar: العثور على مشاريع مفتوحة المصدر والمساهمة فيها

# roadmapStepInternshipTitle
source: Complete Internship
ar: إكمال التدريب

# roadmapStepInternshipDescription
source: Apply for software engineering internships
ar: التقدم لتدريب هندسة البرمجيات

# roadmapCategorySubject
source: Subject
ar: موضوع

# roadmapCategoryProject
source: Project
ar: مشروع

# roadmapCategorySkill
source: Skill
ar: مهارة

# roadmapCategoryExperience
source: Experience
ar: خبرة

# settingsTitle
source: Settings
ar: الإعدادات

# settingsProfileSection
source: Profile
ar: الملف الشخصي

# settingsDisplayName
source: Display Name
ar: الاسم

# settingsEmail
source: Email
ar: البريد الإلكتروني

# settingsAppearanceSection
source: Appearance
ar: المظهر

# settingsLanguage
source: Language
ar: اللغة

# settingsTheme
source: Theme
ar: السمة

# settingsThemeLight
source: Light
ar: فاتح

# settingsThemeDark
source: Dark
ar: داكن

# settingsThemeSystem
source: System
ar: النظام

# settingsNotificationsSection
source: Notifications
ar: الإشعارات

# settingsNotificationsEnabled
source: Enable Notifications
ar: تفعيل الإشعارات

# settingsNotificationsDescription
source: Receive updates and reminders
ar: تلقي التحديثات والتذكيرات

# settingsPrivacySection
source: Privacy & Legal
ar: الخصوصية والقانون

# settingsPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية

# settingsTermsOfUse
source: Terms of Use
ar: شروط الاستخدام

# settingsAbout
source: About SelfMap
ar: حول خريطة الذات

# settingsSupportSection
source: Support
ar: الدعم

# settingsFeedback
source: Send Feedback
ar: إرسال ملاحظات

# settingsReportIssue
source: Report an Issue
ar: الإبلاغ عن مشكلة

# settingsVersion
source: Version {version}
ar: الإصدار {version}

# selectLanguageTitle
source: Select Language
ar: اختر اللغة

# selectThemeTitle
source: Select Theme
ar: اختر السمة

# notSetLabel
source: Not set
ar: غير محدد

# privacyTitle
source: Privacy Policy
ar: سياسة الخصوصية

# privacyConsentTitle
source: Privacy & Consent
ar: الخصوصية والموافقة

# privacyConsentMessage
source: We value your privacy. This app collects minimal data to provide you with personalized recommendations. Your data is never shared with third parties.
ar: نحن نقدر خصوصيتك. يجمع هذا التطبيق الحد الأدنى من البيانات لتزويدك بتوصيات مخصصة. لن يتم مشاركة بياناتك مع أطراف ثالثة.

# privacyConsentAccept
source: I Accept
ar: أوافق

# privacyConsentDecline
source: Decline
ar: رفض

# termsTitle
source: Terms of Use
ar: شروط الاستخدام

# termsAccept
source: I agree to the Terms of Use
ar: أوافق على شروط الاستخدام

# aboutTitle
source: About SelfMap
ar: حول خريطة الذات

# aboutDescription
source: SelfMap is a self-discovery platform designed to help high school students explore their interests, discover careers, and plan their future.
ar: خريطة الذات هي منصة اكتشاف الذات مصممة لمساعدة طلاب المدارس الثانوية على استكشاف اهتماماتهم واكتشاف المهن والتخطيط لمستقبلهم.

# aboutVersion
source: Version {version}
ar: الإصدار {version}

# errorTitle
source: Oops!
ar: عذراً!

# errorGeneric
source: Something went wrong. Please try again.
ar: حدث خطأ ما. يرجى المحاولة مرة أخرى.

# errorNetwork
source: Network error. Please check your connection.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك.

# errorInvalidCredentials
source: Invalid email or password.
ar: بريد إلكتروني أو كلمة مرور غير صحيحة.

# errorEmailInUse
source: This email is already in use.
ar: هذا البريد الإلكتروني مستخدم بالفعل.

# errorWeakPassword
source: Password is too weak.
ar: كلمة المرور ضعيفة جداً.

# errorRetryButton
source: Try Again
ar: حاول مرة أخرى

# errorGoBackButton
source: Go Back
ar: العودة

# emptyStateTitle
source: Nothing here yet
ar: لا يوجد شيء هنا حتى الآن

# emptyStateMessage
source: Check back later for more content
ar: تحقق مرة أخرى لاحقاً لمزيد من المحتوى

# loadingMessage
source: Loading...
ar: جارٍ التحميل...

# savingMessage
source: Saving...
ar: جارٍ الحفظ...

# successMessage
source: Success!
ar: نجح!

# cancelButton
source: Cancel
ar: إلغاء

# saveButton
source: Save
ar: حفظ

# continueButton
source: Continue
ar: متابعة

# doneButton
source: Done
ar: تم

# closeButton
source: Close
ar: إغلاق

# discoverNoQuizzesAvailable
source: No quizzes available at the moment
ar: لا توجد اختبارات متاحة في الوقت الحالي

# discoverNoGamesAvailable
source: No games available at the moment
ar: لا توجد ألعاب متاحة في الوقت الحالي

# discoverErrorLoadingQuizzes
source: Failed to load quizzes
ar: فشل في تحميل الاختبارات

# discoverErrorLoadingGames
source: Failed to load games
ar: فشل في تحميل الألعاب

# discoverRetryButton
source: Retry
ar: إعادة المحاولة

# quizGenericDescription
source: Test your knowledge and skills
ar: اختبر معرفتك ومهاراتك

# gameGenericDescription
source: Fun interactive challenge
ar: تحدي تفاعلي ممتع

# quizWhatYouWillLearn
source: What you will learn:
ar: ما ستتعلمه:

# quizInstructions
source: Instructions:
ar: التعليمات:

# discoverQuizNotFound
source: Quiz not found
ar: الاختبار غير موجود

# discoverQuizNotFoundDesc
source: The requested quiz could not be found.
ar: لا يمكن العثور على الاختبار المطلوب.

# discoverBackToDiscovery
source: Back to Discovery
ar: العودة إلى الاستكشاف

# discoverErrorLoadingQuiz
source: Error loading quiz
ar: خطأ في تحميل الاختبار

# discoverQuizNotSupported
source: Quiz not supported yet
ar: الاختبار غير مدعوم حتى الآن

# discoverQuizNotSupportedDesc
source: This quiz is not yet available. Please try other quizzes.
ar: هذا الاختبار غير متوفر حتى الآن. يرجى تجربة اختبارات أخرى.

# quizRiasecDescription
source: Discover your career interests with the RIASEC model. This assessment helps identify what types of work environments and activities you might enjoy.
ar: اكتشف اهتماماتك المهنية مع نموذج RIASEC. يساعد هذا التقييم في تحديد أنواع بيئات العمل والأنشطة التي قد تستمتع بها.

# quizIpip50Description
source: Understand your personality traits with the Big Five model. This assessment measures five key dimensions of personality.
ar: افهم سمات شخصيتك مع نموذج العوامل الخمسة الكبرى. يقيس هذا التقييم خمسة أبعاد رئيسية للشخصية.

# quizRiasecLearning1
source: Your career interest profile across 6 dimensions
ar: ملف اهتماماتك المهنية عبر 6 أبعاد

# quizRiasecLearning2
source: Which work environments suit you best
ar: بيئات العمل التي تناسبك أكثر

# quizRiasecLearning3
source: Career paths that match your interests
ar: المسارات المهنية التي تتماشى مع اهتماماتك

# quizRiasecLearning4
source: How you compare to others in your age group
ar: كيف تقارن مع الآخرين في فئتك العمرية

# quizIpip50Learning1
source: Your Big Five personality profile
ar: ملف شخصيتك للعوامل الخمسة الكبرى

# quizIpip50Learning2
source: Your strengths and development areas
ar: نقاط قوتك ومجالات التطوير

# quizIpip50Learning3
source: How your personality affects your career choices
ar: كيف تؤثر شخصيتك على اختياراتك المهنية

# quizIpip50Learning4
source: Personalized insights and recommendations
ar: رؤى وتوصيات شخصية

# quizGenericLearning
source: Insights about your personality and career interests
ar: رؤى حول شخصيتك واهتماماتك المهنية

# quizRiasecInstructions
source: Rate each activity based on how much you would enjoy it. There are no right or wrong answers - just be honest about your preferences.
ar: قيّم كل نشاط بناءً على مدى استمتاعك به. لا توجد إجابات صحيحة أو خاطئة - كن صادقاً حول تفضيلاتك.

# quizIpip50Instructions
source: Read each statement and indicate how accurately it describes you. Answer honestly for the most accurate results.
ar: اقرأ كل عبارة وأشر إلى مدى دقة وصفها لك. أجب بصدق للحصول على أدق النتائج.

# quizGenericInstructions
source: Answer all questions honestly. This should take just a few minutes and will provide valuable insights.
ar: أجب على جميع الأسئلة بصدق. سيستغرق هذا بضع دقائق فقط وسيقدم رؤى قيمة.
